experiments/results/thesis/DPFS-NULL-MT/T4/MT_8/fio_randread_4k_64_1_6.out
"randread_4k_64_1": (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=64
fio-3.28
Starting 1 thread

"randread_4k_64_1": (groupid=0, jobs=1): err= 0: pid=5214: Thu Aug 10 23:05:43 2023
  read: IOPS=176k, BW=688MiB/s (721MB/s)(40.3GiB/60001msec)
    slat (usec): min=2, max=245, avg= 4.02, stdev= 1.58
    clat (usec): min=55, max=6906, avg=358.21, stdev=71.34
     lat (usec): min=59, max=6910, avg=362.42, stdev=71.69
    clat percentiles (usec):
     |  1.00th=[  239],  5.00th=[  297], 10.00th=[  326], 20.00th=[  343],
     | 30.00th=[  347], 40.00th=[  351], 50.00th=[  355], 60.00th=[  359],
     | 70.00th=[  363], 80.00th=[  371], 90.00th=[  392], 95.00th=[  408],
     | 99.00th=[  510], 99.50th=[  545], 99.90th=[ 1450], 99.95th=[ 1713],
     | 99.99th=[ 2180]
   bw (  KiB/s): min=562120, max=738184, per=100.00%, avg=704276.02, stdev=28712.77, samples=120
   iops        : min=140530, max=184546, avg=176069.06, stdev=7178.20, samples=120
  lat (usec)   : 100=0.01%, 250=1.65%, 500=97.15%, 750=1.04%, 1000=0.02%
  lat (msec)   : 2=0.13%, 4=0.01%, 10=0.01%
  cpu          : usr=29.68%, sys=68.11%, ctx=40231, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=10563154,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=688MiB/s (721MB/s), 688MiB/s-688MiB/s (721MB/s-721MB/s), io=40.3GiB (43.3GB), run=60001-60001msec